![png](books_demo.png)

In [1]:
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = quote_plus("2024Fever.56")
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
q = """SELECT * FROM users"""
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, first_name, last_name, email]
Index: []

In [4]:
q = """DESCRIBE users"""
pd.read_sql(q, conn)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [5]:
q = """SHOW TABLES"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [6]:
#Load files from the CSV file into pandas
users = pd.read_csv("users  - users.csv")
books = pd.read_csv("books - books.csv")
favorites = pd.read_csv("favorites - favorites.csv")
authors = pd.read_csv("authors - authors.csv")

In [7]:
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [8]:
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [12]:
replacements = {"user_id":"users_id",
               "book_id":"books_id"}

In [13]:
favorites = favorites.rename(replacements, axis=1)

In [14]:
favorites

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5
5         3         5
6         3         6

In [15]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [16]:
replacement_books_table = {"author_id":"authors_id"}

In [17]:
books = books.rename(replacement_books_table, axis=1)

In [18]:
books

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

In [19]:
q = """SHOW TABLES"""
pd.read_sql(q, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [20]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
conn.execute(q)

In [21]:
authors.to_sql("authors", conn, index=False, if_exists='append')
books.to_sql("books", conn, index=False, if_exists='append')
favorites.to_sql("favorites", conn, index=False, if_exists='append')
users.to_sql("users", conn, index=False, if_exists='append')

3

In [22]:
authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [23]:
q = """SELECT * FROM authors"""
pd.read_sql(q, conn)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [24]:
q = """SELECT * FROM users"""
pd.read_sql(q, conn)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [25]:
q = """SELECT * FROM books"""
pd.read_sql(q, conn)

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

In [26]:
q = """SELECT * FROM favorites"""
pd.read_sql(q, conn)

   books_id  users_id
0         1         1
1         2         1
2         3         1
3         4         2
4         5         2
5         5         3
6         6         3

In [27]:
q = """SELECT books.title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.books_id
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""
pd.read_sql(q, conn)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1